saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.V2M-MPS2_CMx_BSP.1.7.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>V2M-MPS2_CMx_BSP</name>
  <description>ARM V2M-MPS2 Board Support PACK for Cortex-M System Design Kit Devices</description>

  <releases>
    <release version="1.7.0" date="2018-06-11">
      Added MTB/ETM targets to ARMv8MBL Secure/Non-Secure example.
      Updated USART driver.
      Updated source and SVD files.
    </release>
    <release version="1.6.0" date="2017-02-08">
      Disable local processor reset for v8-M devices. Not available for this architecture.
      Updated ARMv8M Mainline FPU settings in partition*.h
      Updated ARMv8-M Mainline system file.
    </release>
    <release version="1.5.0" date="2016-11-14">
      Updated ARMv8-M device with processor attribute Dtz.
      Updated device startup files.
      Updated ARMv8MBL_S_NS example.
      Update Mainline and Baseline Debug Description to detect if Debug Authentication can be changed.
    </release>
    <release version="1.4.0" date="2016-09-29">
      ARMv8-M targets:
      - requiresARM.CMSIS.5.0.0-BETA12 pack.
      - updated ARMv8MBL_S_NS example.
      - updated CMSDK_ARMv8M partition file
      -- replaced macro definition __SAU_PRESENT with __SAU_REGION_PRESENT.
      -- corrected write access SCB_AIRCR register.
      - corrected GLCD driver for use with ARMCLANG and fixed warnings for all drivers.
      - added GCC based ARMv8MBL_S_NS example project.
      - added debug description for ARMv8-M Mainline device family (debug authentication).
      - corrected write access SCB_AIRCR register.
      Added CMSIS USART_Driver.
      Updated device descriptions: Configure JTAG as default debug protocol.
      Added CMSDK SVD files
    </release>
    <release version="1.3.0" date="2016-05-09">
      Added FastModels Target to all M0, M0+, M3, M4, M7 Examples (requires MDK-5.20 and MDK-Professional license)
      Updated CMSDK_ARMv8MML device files (requires ARM.CMSIS.5.0.0-BETA4 or higher)
      - added CMSDK_ARMv8MML_FP to CMSDK_ARMv8MML_SP, CMSDK_ARMv8MML_DP.
      - added SVD file for SAU in ARMv8MBL device
      - updated CMsDK_ARMv8MBL setting __MPU_PRESENT to 1
      - updated partition files
    </release>
    <release version="1.2.0" date="2016-04-07">
      CMSDK_ARMv8MBL example requires: ARM.CMSIS.5.0.0-BETA3.pack
      updated CMSDK_ARMv8MML and CMSDK_ARMv8MBL CMSIS device files
      - renamed core_ARMv8M?L.h to core_armv8m?l.h.
      - renamed partition_ARMv8M?L.h to partition_CMSDK_ARMv8M?L.h.
      - updated number of SAU regions from 4 to 8
      - moved TZ_SAU_Setup() to partition file
      - corrected CMSDK device interrupt assignment.
      updated Examples:
      - CMSDK_ARMv8MMLARMv8MBL example
      -- updated MTB setup to new MTB SFR base address
      -- support of example INI script from both secure and non-secure build targets
      - V2M-MPS2 Examples:
      -- reworked V2M-MPS2 board support
      -- reworked all RTX Blinky examples
      updated documentation
    </release>
    <release version="1.1.0" date="2014-09-24">
      Added Cortex-M7 Support/Examples.
      Updated device families and conditions to match CMSIS pack version 4.2.0.
      Added board description for "V2M-MPS2".
    </release>
    <release version="1.0.0">
      First Release version of V2M-MPS2 Board Support Pack including Device definition.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ARM</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package ARM CMSDK</keyword>
    <keyword>Board Support Package for V2M-MPS2</keyword>
    <keyword>CMSDK_CM0</keyword>
    <keyword>CMSDK_CM0plus</keyword>
    <keyword>CMSDK_CM3</keyword>
    <keyword>CMSDK_CM4</keyword>
    <keyword>CMSDK_CM7</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M0  ****************************** -->
    <family Dfamily="ARM Cortex M0" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0497A_cortex_m0_r0p0_generic_ug.pdf" title="Cortex-M0 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M0 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM0">
        <processor Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM0.svd"/>
        <compile header="Device/CMSDK_CM0/Include/CMSDK_CM0.h" define="CMSDK_CM0"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M0P  ***************************** -->
    <family Dfamily="ARM Cortex M0 plus" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M0+ based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM0plus">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM0plus.svd"/>
        <compile header="Device/CMSDK_CM0plus/Include/CMSDK_CM0plus.h" define="CMSDK_CM0plus"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M3  ****************************** -->
    <family Dfamily="ARM Cortex M3" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0552A_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M3 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM3">
        <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM3.svd"/>
        <compile header="Device/CMSDK_CM3/Include/CMSDK_CM3.h" define="CMSDK_CM3"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M4  ****************************** -->
    <family Dfamily="ARM Cortex M4" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M4 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000" startup="1" default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000" init   ="0" default="1"/>

      <device Dname="CMSDK_CM4">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM4.svd"/>
        <compile header="Device/CMSDK_CM4/Include/CMSDK_CM4.h" define="CMSDK_CM4"/>
      </device>

      <device Dname="CMSDK_CM4_FP">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM4_FP.svd"/>
        <compile header="Device/CMSDK_CM4/Include/CMSDK_CM4_FP.h" define="CMSDK_CM4_FP"/>
      </device>
    </family>

    <!-- ******************************  Cortex-M7  ****************************** -->
    <family Dfamily="ARM Cortex M7" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <book name="Documents/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
      <description>
Cortex-M System Design Kit: Cortex-M7 based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00400000"  startup="1"  default="1"/>
      <memory id="IRAM1" start="0x20000000" size="0x00400000"  init   ="0"  default="1"/>

      <device Dname="CMSDK_CM7">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM7.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7.h" define="CMSDK_CM7"/>
      </device>

      <device Dname="CMSDK_CM7_SP">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM7_SP.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7_SP.h" define="CMSDK_CM7_SP"/>
      </device>

      <device Dname="CMSDK_CM7_DP">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p0" Dfpu="DP_FPU" Dmpu="MPU" Dendian="Little-endian" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_CM7_DP.svd"/>
        <compile header="Device/CMSDK_CM7/Include/CMSDK_CM7_DP.h" define="CMSDK_CM7_DP"/>
      </device>
    </family>

    <!-- ******************************  ARMv8-M Baseline  *********************** -->
    <family Dfamily="ARMv8-M Baseline" Dvendor="ARM:82">
      <debugconfig default="jtag" swj="true"/>     <!-- Select JTAG as default protocol -->

      <!--book name="Device/Documents/ARMv8MML_dgug.pdf" title="ARMv8MML Device Generic Users Guide"/-->
      <description>
Cortex-M System Design Kit: ARMv8M Baseline Processor based device
      </description>

      <memory id="IROM1" start="0x00000000" size="0x00200000" startup="1" default="1"/>
      <memory id="IROM2" start="0x00200000" size="0x00200000" startup="0" default="0"/>
      <memory id="IRAM1" start="0x20000000" size="0x00200000" init   ="0" default="1"/>
      <memory id="IRAM2" start="0x20200000" size="0x00200000" init   ="0" default="0"/>

      <debugvars configfile="Device/CMSDK_ARMv8MBL/Debug/ARMv8MBL.dbgconf">
        // Debug Authentication Variables
        __var DAuthFixed  = 0x1;     // 1 - Use fixed authentication, 0 - Ask for user input
        __var DAuthConfig = 0xF;     // Authentication Value (MPS2 Security Control Block)
        // Bit 0 - Invasive Debug (Hardwired to 1)
        // Bit 1 - Non-Invasive Debug (Hardwired to 1)
        // Bit 2 - Invasive Secure Debug
        // Bit 3 - Non-Invasive Secure Debug
      </debugvars>

