saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.V2M-MPS2_CMx_BSP.1.7.0.pdsc
      <device Dname="CMSDK_ARMv8MML_SP">
        <processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Configurable" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_ARMv8MML_SP.svd"/>
        <compile header="Device/CMSDK_ARMv8MML/Include/CMSDK_ARMv8MML_SP.h" define="CMSDK_ARMv8MML_SP"/>
      </device>

      <device Dname="CMSDK_ARMv8MML_DP">
        <processor Dcore="ARMV8MML" DcoreVersion="r0p1" Dfpu="DP_FPU" Dmpu="MPU" Dtz="TZ" Dendian="Configurable" Dclock="25000000"/>
        <debug svd="SVD/CMSDK_ARMv8MML_DP.svd"/>
        <compile header="Device/CMSDK_ARMv8MML/Include/CMSDK_ARMv8MML_DP.h" define="CMSDK_ARMv8MML_DP"/>
      </device>
    </family>
  </devices>

  <conditions>
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="CMSDK_CM0 CMSIS">
      <description>ARM CMSDK_M0 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM0plus CMSIS">
      <description>ARM CMSDK_M0plus Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM0plus"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM3 CMSIS">
      <description>ARM CMSDK_M3 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM4 CMSIS">
      <description>ARM CMSDK_M4 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM4*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_CM7 CMSIS">
      <description>ARM CMSDK_M7 Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_CM7*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK_ARMv8MBL CMSIS">
      <description>ARM CMSDK_ARMv8MBL Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_ARMv8MBL*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="CMSDK_ARMv8MBL CMSIS GCC">
      <description>ARM CMSDK_ARMv8MBL Device and CMSIS Core requiring GCC</description>
      <require condition="CMSDK_ARMv8MBL CMSIS"/>
      <require condition="GCC"/>
    </condition>

    <condition id="CMSDK_ARMv8MML CMSIS">
      <description>ARM CMSDK_ARMv8MML Device and CMSIS Core</description>
      <require Dvendor="ARM:82" Dname="CMSDK_ARMv8MML*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="CMSDK CMSIS">
      <description>ARM Cortex-M System Design Kit Device</description>
      <accept  condition="CMSDK_CM0 CMSIS"/>
      <accept  condition="CMSDK_CM0plus CMSIS"/>
      <accept  condition="CMSDK_CM3 CMSIS"/>
      <accept  condition="CMSDK_CM4 CMSIS"/>
      <accept  condition="CMSDK_CM7 CMSIS"/>
      <accept  condition="CMSDK_ARMv8MBL CMSIS"/>
      <accept  condition="CMSDK_ARMv8MML CMSIS"/>
    </condition>

    <condition id="V2M-MPS2 Common">
      <description>V2M-MPS2 Common Include files</description>
      <require condition="CMSDK CMSIS"/>
      <require Cclass="Board Support" Cgroup="Common"/>
    </condition>

    <!--condition id="V2M-MPS2 Common LCD_SPI">
      <description>V2M-MPS2 Common and LCD (SPI IF)</description>
      <require condition="V2M-MPS2 Common"/>
      <require Cclass="Graphics" Cgroup="CORE"/>
      <require Cclass="Graphics" Cgroup="Display" Csub="MCBQVGA_LG" Cvariant="SPI IF"/>
    </condition-->
  </conditions>

  <components>
    <!-- V2M-MPS2 Board support -->
    <bundle Cbundle="V2M-MPS2" Cclass="Board Support" Cversion="2.0.0">
      <description>ARM V2M_MPS2 Board Support</description>
      <doc></doc>
      <component Cgroup="Common"                          condition="CMSDK CMSIS">
        <description>Common Include files for ARM V2M_MPS2 Development Board</description>
        <files>
          <file category="header" name="Boards/ARM/V2M-MPS2/Common/Device.h"/>
          <file category="header" name="Boards/ARM/V2M-MPS2/Common/SMM_MPS2.h"/>
        </files>
      </component>
      <component Cgroup="LED"         Capiversion="1.0.0" condition="V2M-MPS2 Common">
      <description>LED driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/LED_V2M-MPS2.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"     Capiversion="1.0.0" condition="V2M-MPS2 Common">
      <description>Button driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/Buttons_V2M-MPS2.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="V2M-MPS2 Common">
        <description>Graphic LCD driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="header" name="Boards/ARM/V2M-MPS2/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/GLCD_V2M-MPS2.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="V2M-MPS2 Common">
        <description>Touchscreen driver for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/Touch_V2M-MPS2.c"/>
        </files>
      </component>
      <!--component Cgroup="emWin LCD" Cvariant="SPI IF" condition="V2M-MPS2 Common LCD_SPI">
        <description>emWin LCD SPI Interface for ARM V2M_MPS2 Board</description>
        <files>
          <file category="source" name="Boards/ARM/V2M-MPS2/Common/LCD_X_V2M-MPS2.c"/>
        </files>
      </component-->
    </bundle>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1.0" Cversion="1.0.3" condition="CMSDK CMSIS">
      <description>USART Driver for ARM V2M_MPS2 Board</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_V2M-MPS2.c"/>
      </files>
    </component>

