saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.V2M-MPS2_CMx_BSP.1.7.0.pdsc
    <!-- CMSDK_M0 Startup -->
    <component Cclass="Device" Cgroup="Startup"                         Cversion="1.0.0" condition="CMSDK_CM0 CMSIS">
      <description>System and Startup for ARM CMSDK_CM0 device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/CMSDK_CM0/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/CMSDK_CM0/Source/ARM/startup_CMSDK_CM0.s"         attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/CMSDK_CM0/Source/system_CMSDK_CM0.c"              attr="config" version="1.0.0"/>

        <!-- device configuration -->
        <file category="header"  name="CMSIS/Config/RTE_Device.h"                              attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSDK_M0+ Startup -->
    <component Cclass="Device" Cgroup="Startup"                         Cversion="1.0.0" condition="CMSDK_CM0plus CMSIS">
      <description>System and Startup for ARM CMSDK_CM0plus device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/CMSDK_CM0plus/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/CMSDK_CM0plus/Source/ARM/startup_CMSDK_CM0plus.s" attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/CMSDK_CM0plus/Source/system_CMSDK_CM0plus.c"      attr="config" version="1.0.0"/>

        <!-- device configuration -->
        <file category="header"  name="CMSIS/Config/RTE_Device.h"                              attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSDK_M3 Startup -->
    <component Cclass="Device" Cgroup="Startup"                         Cversion="1.0.0" condition="CMSDK_CM3 CMSIS">
      <description>System and Startup for ARM CMSDK_CM3 device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/CMSDK_CM3/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/CMSDK_CM3/Source/ARM/startup_CMSDK_CM3.s"         attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/CMSDK_CM3/Source/system_CMSDK_CM3.c"              attr="config" version="1.0.0"/>

        <!-- device configuration -->
        <file category="header"  name="CMSIS/Config/RTE_Device.h"                              attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSDK_M4 Startup -->
    <component Cclass="Device" Cgroup="Startup"                         Cversion="1.0.0" condition="CMSDK_CM4 CMSIS">
      <description>System and Startup for ARM CMSDK_CM4 device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/CMSDK_CM4/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/CMSDK_CM4/Source/ARM/startup_CMSDK_CM4.s"         attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/CMSDK_CM4/Source/system_CMSDK_CM4.c"              attr="config" version="1.0.0"/>

        <!-- device configuration -->
        <file category="header"  name="CMSIS/Config/RTE_Device.h"                              attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSDK_M7 Startup -->
    <component Cclass="Device" Cgroup="Startup"                         Cversion="1.0.0" condition="CMSDK_CM7 CMSIS">
      <description>System and Startup for ARM CMSDK_CM7 device</description>
      <files>
        <!-- device include path -->
        <file category="include" name="Device/CMSDK_CM7/Include/"/>
        <!-- startup / system file -->
        <file category="source" name="Device/CMSDK_CM7/Source/ARM/startup_CMSDK_CM7.s"         attr="config" version="1.0.0" condition="ARMCC"/>
        <file category="source" name="Device/CMSDK_CM7/Source/system_CMSDK_CM7.c"              attr="config" version="1.0.0"/>

        <!-- device configuration -->
        <file category="header"  name="CMSIS/Config/RTE_Device.h"                              attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- CMSDK_ARMv8MBL Startup -->
    <component Cclass="Device" Cgroup="Startup"                         Cversion="1.0.0" condition="CMSDK_ARMv8MBL CMSIS">
      <description>System and Startup for ARM CMSDK_ARMv8MBL device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"      name="Device/CMSDK_ARMv8MBL/Include/"/>
        <!-- startup / system file -->
        <file category="sourceAsm"    name="Device/CMSDK_ARMv8MBL/Source/ARM/startup_CMSDK_ARMv8MBL.s"         version="1.0.0" attr="config" condition="ARMCC"/>
        <!-- .S files need to be preprocessed -->
        <file category="sourceC"      name="Device/CMSDK_ARMv8MBL/Source/GCC/startup_CMSDK_ARMv8MBL.S"         version="1.0.0" attr="config" condition="GCC"/> 
        <file category="linkerScript" name="Device/CMSDK_ARMv8MBL/Source/GCC/gcc_arm.ld"                       version="1.0.0" attr="config" condition="GCC"/>
        <file category="sourceC"      name="Device/CMSDK_ARMv8MBL/Source/system_CMSDK_ARMv8MBL.c"              version="1.0.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"       name="Device/CMSDK_ARMv8MBL/Include/Template/partition_CMSDK_ARMv8MBL.h" version="1.0.0" attr="config"/>
        <!-- device configuration -->
        <file category="header"       name="CMSIS/Config/RTE_Device.h"                                         version="1.0.0" attr="config"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="C Startup"    Cversion="1.0.1" condition="CMSDK_ARMv8MBL CMSIS GCC">
      <description>System and Startup for ARM CMSDK_ARMv8MBL device</description>
      <files>
        <!-- include folder / device header file -->
        <file category="include"      name="Device/CMSDK_ARMv8MBL/Include/"/>
        <!-- startup / system file -->
        <file category="sourceC"      name="Device/CMSDK_ARMv8MBL/Source/GCC/startup_CMSDK_ARMv8MBL.c"         version="1.0.0" attr="config" condition="GCC"/>
        <file category="linkerScript" name="Device/CMSDK_ARMv8MBL/Source/GCC/gcc_arm.ld"                       version="1.0.0" attr="config" condition="GCC"/>
        <file category="sourceC"      name="Device/CMSDK_ARMv8MBL/Source/system_CMSDK_ARMv8MBL.c"              version="1.0.0" attr="config"/>
        <!-- SAU configuration -->
        <file category="header"       name="Device/CMSDK_ARMv8MBL/Include/Template/partition_CMSDK_ARMv8MBL.h" version="1.0.0" attr="config"/>
        <!-- device configuration -->
        <file category="header"       name="CMSIS/Config/RTE_Device.h"                                         version="1.0.0" attr="config"/>
      </files>
    </component>

